In [1]:
import numpy as np
import pandas as pd
import plotly.express as px
import plotly.io as pio
pio.renderers.default='iframe'

In [2]:
df = pd.read_csv("./output.csv")

## Countries

\# TO-DO: improve graphs' title and scale

In [3]:
countries = df['country'].value_counts().reset_index()
countries.columns = ['Country', 'Count']
countries['LogCount'] = np.log2(countries['Count'])
countries

                         Country  Count   LogCount
0                          India  68363  16.060928
1                          China  24353  14.571812
2                     Bangladesh  16188  13.982637
3                         Russia  13261  13.694902
4                          Egypt   9522  13.217049
..                           ...    ...        ...
244  French Southern Territories      1   0.000000
245            Equatorial Guinea      1   0.000000
246                 Sint Maarten      1   0.000000
247                      Curacao      1   0.000000
248                      Eritrea      1   0.000000

[249 rows x 3 columns]

In [4]:
fig = px.choropleth(
    countries,
    locations='Country',
    locationmode='country names',
    color='Count',
    hover_name='Country',
    color_continuous_scale=px.colors.sequential.Plasma
)

fig.update_layout(
    title_text='Choropleth Map of Countries by Occurrences',
    geo=dict(showframe=False, showcoastlines=False, projection_type='equirectangular')
)

fig.show()

In [5]:
fig = px.choropleth(
    countries,
    locations='Country',
    locationmode='country names',
    color='LogCount',
    hover_name='Country',
    color_continuous_scale=px.colors.sequential.Plasma
)

fig.update_layout(
    title_text='Choropleth Map of Countries by Logarithmic Occurrences',
    geo=dict(showframe=False, showcoastlines=False, projection_type='equirectangular')
)

fig.show()

## Universities

In [6]:
organizations = df['organization'].value_counts().reset_index()
organizations.columns = ['Organization', 'Count']
organizations.head(20)

                                         Organization  Count
0                                         IIT Roorkee   1658
1                                    IIT BHU Varanasi   1562
2                                      IIIT Hyderabad   1374
3                      Delhi Technological University   1324
4                                       IIT Kharagpur   1147
5                                        IIT Guwahati   1075
6                                          IIT Kanpur   1041
7                                           IIT Delhi    876
8                        BITS Pilani Hyderabad Campus    777
9                                    Jiangly Fan Club    760
10                                          IIT Patna    744
11                                     IIIT Allahabad    679
12  Rajshahi University of Engineering and Technology    627
13                          FCIS Ain Shams University    615
14                                         IIT Indore    611
15                                    ITMO University    575
16              BIRLA INSTITUTE OF TECHNOLOGY,  MESRA    565
17                                         IIIT Delhi    563
18                                               BUET    560
19                                   IIT(ISM) DHANBAD    558